@romankor I've tried to reproduce the issue with the following terraform file:
```
resource "twingate_remote_network" "aws_network" {
  name = "aws_remote_network"
}

resource "twingate_connector" "aws_connector" {
  remote_network_id = twingate_remote_network.aws_network.id
}
````

then I importing connector with cmd:
```
terraform import twingate_connector.aws_connector Q29ubmVjdG9yOjI2NzM=
```

I've checked local state file
```
"schema_version": 0,
          "attributes": {
            "id": "Q29ubmVjdG9yOjI2NzM=",
            "name": "watchful-weasel",
            "remote_network_id": null
          },
```

as you see `remote_network_id` is not set 

plan shows info like that

```
$ terraform plan
twingate_connector.aws_connector: Refreshing state... [id=Q29ubmVjdG9yOjI2NzM=]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # twingate_connector.aws_connector must be replaced
-/+ resource "twingate_connector" "aws_connector" {
      ~ id                = "Q29ubmVjdG9yOjI2NzM=" -> (known after apply)
      ~ name              = "watchful-weasel" -> (known after apply)
      + remote_network_id = (known after apply) # forces replacement
    }

  # twingate_remote_network.aws_network will be created
  + resource "twingate_remote_network" "aws_network" {
      + id   = (known after apply)
      + name = "aws_remote_network"
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

